<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">STRING Operators </h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">String operations in the context of databases typically involve manipulating, searching, and performing various actions on string (text) data stored in columns.</div>

In [2]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql SELECT * FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris'),
 ('Charlie', 'Wilson', 30, 'London')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">LIKE
    <ul>The LIKE operator in SQL is used to search for a specified pattern in a column.<br>It is often used in the WHERE clause of a SELECT statement to filter rows based on a pattern match.</ul></div>

In [10]:
%sql SELECT * FROM lg WHERE firstname LIKE "%E%"

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('Jane', 'Smith', 40, 'New York'),
 ('Alice', 'Brown', 46, 'Paris'),
 ('Charlie', 'Wilson', 30, 'London')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Filter all data whose firstname in e include </div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2</div>

In [13]:
%sql SELECT * FROM lg WHERE age LIKE "%4%"

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Filter all data whose age in 4 include </div>

## Example 3

In [14]:
%sql SELECT * FROM lg WHERE firstname LIKE "%li%"

# Filter all data whose firstname in li include

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('Alice', 'Brown', 46, 'Paris'), ('Charlie', 'Wilson', 30, 'London')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">NOT LIKE
    <ul>The NOT LIKE operator in SQL is used to filter rows based on a pattern that does not match in a column.<br>It is the negation of the LIKE operator.<br>The NOT LIKE operator returns rows where the specified column's value does not match the specified pattern.</ul></div>

In [15]:
%sql SELECT * FROM lg WHERE firstname NOT LIKE "%li%"

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London')]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">STRING Functions</h1>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">CONCAT()
    <ul>The CONCAT function is commonly used for string concatenation in SQL<br>It is the negation of the LIKE operator.<br>It is an operator that joins two or more strings together.</ul></div>

In [51]:
%sql SELECT CONCAT(firstname, ' ' ,lastname) AS "fullname" FROM lg;

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('John Doe',),
 ('Jane Smith',),
 ('Bob Johnson',),
 ('Alice Brown',),
 ('Charlie Wilson',)]

<br>
<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">SUBSTRING
    <ul>The SUBSTRING function in SQL is used to extract a substring from a string.<br>It allows you to specify the starting position and the length of the substring you want to retrieve.<br><br></ul>SYNTAX<ul>SUBSTRING(string_expression, start_position, length)</ul></div>

In [69]:
%sql SELECT SUBSTRING('Hello World', 1, 5) AS result;

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Hello',)]

In [75]:
%sql SELECT SUBSTRING(firstname, 1, 3) AS result FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('Joh',), ('Jan',), ('Bob',), ('Ali',), ('Cha',)]

<br>
<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">LENGTH
    <ul>The LENGTH function is used to determine the length (number of characters) of a string in SQL Server.<br>It is specifically used in Transact-SQL, which is the SQL dialect used by Microsoft SQL Server.</ul></div>

In [80]:
%sql SELECT LENGTH(firstname) AS 'length of firstname' FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[(4,), (4,), (3,), (5,), (7,)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">UPPER
    <ul>The UPPER function is used to convert all the characters in a string to uppercase in SQL.<br>It's commonly used to perform case-insensitive comparisons or to standardize the case of data.</ul></div>

In [81]:
%sql SELECT UPPER(firstname) AS 'firstname' FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('JOHN',), ('JANE',), ('BOB',), ('ALICE',), ('CHARLIE',)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">TRIM
    <ul>The TRIM function in SQL is used to remove specified prefixes or suffixes (or both) from a string.<br>It's commonly used to remove leading or trailing spaces from a string, but it can be more versatile depending on the database system.</ul><br><br>Syntax<ul>TRIM([ { LEADING | TRAILING | BOTH } [ trim_character ] FROM ] string_expression)<br><br>
        <ol>LEADING: Removes characters only from the beginning of the string.</ol>
                <ol>TRAILING: Removes characters only from the end of the string.</ol>
                        <ol>BOTH: Removes characters from both the beginning and the end of the string.</ol>

</ul></div>

## LEADING

In [116]:
%sql SELECT TRIM(LEADING 'x' FROM 'xHello Worldx') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Hello Worldx',)]

## TRAILING

In [117]:
%sql SELECT TRIM(TRAILING 'x' FROM 'xHello Worldx') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('xHello World',)]

## BOTH

In [118]:
%sql SELECT TRIM(BOTH 'x' FROM 'xHello Worldx') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Hello World',)]

<br>
<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">REPLACE
    <ul>The REPLACE function in SQL is used to replace occurrences of a specified substring with another substring in a given string.<br>It's often used for string manipulation to update or modify data within a column.<br><br></ul>Syntax<ul>REPLACE(original_string, search_string, replacement_string)</ul></div>

In [125]:
%sql SELECT REPLACE("Mubeen",'e','_') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Mub__n',)]

In [129]:
%sql SELECT REPLACE(firstname,'J','_') AS "replacement" FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('_ohn',), ('_ane',), ('Bob',), ('Alice',), ('Charlie',)]